<!DOCTYPE html>
<html> 
<head>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title></title>
	<link rel="stylesheet" type="text/css" href="index_html.css">
</head>
<body>
<div class="textstyle1">
<span class="textstyle2"><br/></span>  </div>
<div class="textstyle3">
<div id="container_83d87bc"><div class="textstyle3"><div id="container_60320bed"><div id="container_60320bed_padding" ><div class="textstyle1"><div id="container_1383d4b1"><div id="container_1383d4b1_padding" ><div class="textstyle1"></div>
<div class="textstyle3">  <span class="textstyle4">Programacion Web</span>
</div>
</div></div></div>
<div style="clear:both"></div></div></div><div id="container_4a5a90a8"><div class="textstyle3"><span class="textstyle2"><br/><br/><br/><br/><br/><br/><br/><br/></span><span class="textstyle5"><br/></span><div id="container_6470dc24"><div id="container_6470dc24_padding" ><div class="textstyle1"></div>
<div class="textstyle3">  <span class="textstyle6">Consultas</span>
</div>
</div></div><span class="textstyle5"><br/><br/></span><span class="textstyle2">       </span><span class="textstyle2"><br/><br/><br/><br/></span></div>
</div><span class="textstyle7"><br/></span><span class="textstyle8"><br/>&#191;Qu&#233; es el modelo DOM?</span><span class="textstyle9"><br/>El Modelo de Objetos del Documento, cuyas siglas son DOM, es una interfaz de programaci&#243;n de aplicaciones para documentos HTML y XML. El modelo DOM define la estructura l&#243;gica de los documentos y el modo en que se accede a ellos y se los manipula. Con el Modelo de Objetos del Documento, los programadores pueden construir documentos, navegar por su estructura, y a&#241;adir, modificar o eliminar elementos y contenido.</span><span class="textstyle10"><br/><br/></span><span class="textstyle7"><br/><br/><br/></span></div>
<div class="textstyle1"><div id="container_749be54d"><div id="container_749be54d_padding" ><div class="textstyle3"><span class="textstyle11"><br/>Terminos de Internet</span><span class="textstyle12"><br/></span><img src="rc_images/glosario_de_t_rminos.png" width="640" height="433" id="img_91ac625" alt="" title="" /><span class="textstyle13"><br/>Ancho de banda<br/>Es una medida que nos indica la velocidad de Internet, es decir, la velocidad de transmisi&#243;n de datos de una l&#237;nea de conexi&#243;n. Se mide bps (bits por segundo), por ejemplo 32 kbps, 64 kbps, 1Mbps, etc.<br/><br/>Banner<br/>Se trata de un aviso publicitario dentro de una p&#225;gina web. Es un t&#233;rmino ingl&#233;s que se traduce como banderola. Haciendo Clic sobre &#233;l, te redirige al sitio del anunciante.<br/><br/>Cach&#233;<br/>Almacenamiento temporal de datos para agilizar el acceso a las &#250;ltimas p&#225;ginas visitadas por el usuario.<br/><br/>Cookie<br/>Se trata de peque&#241;os archivos con datos que algunos sitios web almacenan de forma autom&#225;tica en el navegador del usuario. Suelen utilizarse para conocer las preferencias de los usuarios.<br/><br/>Direcci&#243;n IP<br/>N&#250;mero que identifica nuestro ordenador en la red. Est&#225; compuesta de cuatro n&#250;meros separados por puntos ( por ejemplo 157.135.7.43).<br/><br/>FAQ<br/>Son las siglas de &#8220;Frequently Asked Questions&#8221;. Significa: Preguntas m&#225;s frecuentes. Es una lista de pregunta y respuestas. Se recogen las respuestas a las preguntas m&#225;s comunes sobre alg&#250;n tema en particular.<br/><br/>Firewall<br/>Firewall o cortafuegos. Mecanismo de seguridad de un sistema, dise&#241;ado para bloquear el acceso no autorizado.<br/><br/>Fotolog o Fotoblog<br/>Blog cuyas entradas fundamentalmente se componen de im&#225;genes fotogr&#225;ficas.<br/><br/>Freeware<br/>Se refiere al programa que se pueden descargar de forma gratuita desde Internet.<br/><br/>Hacker<br/>Se le conoce con este nombre a la persona que tiene un conocimiento avanzado acerca del funcionamiento de redes inform&#225;ticas de forma que puede advertir los errores y fallas de seguridad del mismo.<br/></span><span class="textstyle10"><br/></span><span class="textstyle14"><br/><br/><br/></span></div>
<div style="clear:both"></div></div></div><div id="container_459f1faa"><div id="container_459f1faa_padding" ><div class="textstyle1"><div id="container_19d801ec"><div id="container_19d801ec_padding" ><div class="textstyle3"><span class="textstyle11"><br/>&#191;Qu&#233; es un protocolo de red?</span><span class="textstyle12"><br/></span><span class="textstyle15"><br/>Los protocolos de red son aquellos que usa el internet y los medios digitales para transmitir la informacion de un extremo a otro, los mas usados son:<br/></span><span class="textstyle13"><br/>HTML<br/>HTTP, de sus siglas en ingl&#233;s: &quot;Hypertext Transfer Protocol&quot;, es el nombre de un protocolo el cual nos permite realizar una petici&#243;n de datos y recursos, como pueden ser documentos HTML. <br/>TCP/IP<br/>Pertenece a la capa de red y es la que nos permite llegar de un destino de red a otro, cada uno de nuestros dispositivos lo deben terner para poner conectarse a cualquier red.<br/>DNS<br/>Los DNS es lo que nos transforma las direcciones ip  en nombres, esto con el fin de que sea mas facil de aprender y poder visitar paginas web.<br/>CDN<br/>Red de Distribuci&#243;n de Contenido, es b&#225;sicamente un conjunto de servidores ubicados en diferentes puntos de una red que contienen copias locales de ciertos contenidos (v&#237;deos, im&#225;genes, m&#250;sica, documentos, webs, etc.) que est&#225;n almacenados en otros servidores generalmente alejados geogr&#225;ficamente, de forma que sea posible servir dichos contenidos de manera m&#225;s eficiente.<br/>WWW<br/>Sigla de la expresi&#243;n inglesa World Wide Web, 'red inform&#225;tica mundial', sistema l&#243;gico de acceso y b&#250;squeda de la informaci&#243;n disponible en Internet, cuyas unidades informativas son las p&#225;ginas web.<br/>FTP<br/>Las siglas de FTP significan File Transfer Protocol, que se traduce como Protocolo de Transferencia de Archivos. Como su nombre indica, se trata de un protocolo que permite transferir archivos directamente de un dispositivo a otro. Actualmente, es un protocolo que poco a poco va abandon&#225;ndose, pero ha estado vigente m&#225;s de 50 a&#241;os.<br/>HTML<br/>HTML es el lenguaje con el que se define el contenido de las p&#225;ginas web. B&#225;sicamente se trata de un conjunto de etiquetas que sirven para definir el texto y otros elementos que compondr&#225;n una p&#225;gina web, como im&#225;genes, listas, v&#237;deos, etc.<br/><br/></span><span class="textstyle14"><br/></span></div>
</div></div></div>
<div style="clear:both"></div></div></div></div>
</div>  </div>
</body>
</html>